"use client";

import { useState } from "react";
import { Search, X } from "lucide-react";

const data = [
  " ১।আজিজ সরদার -শ্রীকলা -৳৪৭৫ ",
  " ২।আবু হোসেন। আজিজ সরদার। শৃকলা -৳৫৯২৮ ",
  " ৩।রফিকুল সদ্দার। শৃকলা-৳১২০৫২ ",
  " ৪।বাবলু মাস্টার। আব্দুল কাদের। শৃঙ্খলা -৳১৬৫৭ ",
  " ৫।রুবেল কম্পিউটার। ৳-৩৪৯৩ ",
  " ৬।কমলেশ। বেলি পুকুর। ৳-৫৭০ ",
  " ৭।হেলাল হুজুর। ৳-৭৯০ ",
  "৮।মিজানুর স্যার। রজব আলী। -৳-২৬৮৪  ",
  " ৯।আইয়ুব ভাই। ৳-১৩২০ ",
  " ১০।লিটন গাজী। মালেক গাজী। -৳১৫০ ",
  "  ১১।কুদ্দুস সরদার। তমিজ উদ্দিন। ৳১৮৩০",
  "১২।শাকিলা ভাবি। ৳-১৬০৭  ",
  " ১৩।রবিউল ঢালী। নেসার ঢালী। ৳-১২৬০ ",
  " ১৪।শরিফুল হার্ডওয়ার্ক।-৳-৩৯৬ ",
  " ১৫।সাইন সরদার। আবুল.-৳১৫৬৩ ",
  " ১৬।বাবু মল্লিক। নিরদ মল্লিক ৳৮০ ",
  "১৭.আমিন সরদার। মোকসে সদ্দার।-৳-৩৫০  ",
  "১৮.মমতাজ স্যার ৳-১৯২০  ",
  "২০।হাকিম ইলেকট্রনিক। ৳-১২৪৫  ",
  "২১.সিদ্দিক ভাই ১৬১২ টাকা  ",
  " ২২.রাজ্জাক ভাই মাছ ৳-১৮৮ ",
  " ২৪.সবুর সরদার ৭০৪৮ টাকা ",
  " ২৫.ডাক্তার হাকিম ১৭০ টাকা ",
  " ২৬.শফিকুল চাচা ১৫১৩ টাকা ",
  " ২৭.আবেদার বোনাই ২৩৮৮৩ টাকা ",
  " ২৯.মাসুম চা-৳-২৯৩৪ ",
  " ৩১.ডাক্তার লেন্টু-৳-৫১৮ ",
  " ৩২.শাহাজামাল চা ৳-৩৬৮২ ",
  " ৩৩.রাকিব শেখ ৳১১৩১ ",
  " ৩৪. রবিউল সরদার  :আরমান সরদার ৳২৫০ ",
  "৩৫.অরুন মন্ডল :বেলেপুকুর ৳১৫৩৩  ",
  "  ৩৬. নজরুল :বাবুর্চি  ৳১৪৯০",
  " ৩৭.মামুন সরদার :শাকের সরদার  ৳৪৪৩৭ ",
  "  ৩৮.রবি মল্লিক ৳১৩১২",
  " ৩৯.খোকন : ডাঃশুকো:৳৭০ ",
  "  ৪০.ইসমাইল মোড়ল :মাদ্রাসা ৳২০০",
  "৪১.বদর মোড়ল :৳৯২২  ",
  " ৪২.দাউদ সরদার৳১১০ ",
  " ৪৩.মোস্তার :ফিড৳৪৩৬০ ",
  " ৪৪.আশরাফুল বিদেশ :বেলেপুকুর ৳২০৬৩ ",
  "৪৫. মিঠু, বেলে পুকুর ৳১৩৩০  ",
  " ৪৬.তাবারক  স্যার৳১৭৫৫ ",
  " ৪৭.সিরাজুল :কাঠমিস্ত্রি :(রইছুদ্দীন)২৮২ ",
  " ৪৮.ফাজের ভাই : মাছ৳২৬০ ",
  " ৪৯.শাহাদাৎ কারিকার৳৭০ ",
  " ৫০.আমজেদ কারিকর ৳৪০০ ",
  " ৫১.সাইফুল জামাই  ৳১২২৭ ",
  " ৫২.সুরাত কারিগর  ৳২১৪৮ ",
  " ৫৩.শফিকুল গাজী ঈদগাহ ৳৩৭০ ",
  " ৫৪.বাবলু ঢালী :আনার ঢালী  ১৪২০ ",
  " ৫৫.মোস্তার সেলুন  ৳৫৫ ",
  " ৫৬.মুরাদ:রেজাউল সরদার  ৳ ৭৫ ",
  "৫৭.রেজাউল কারিগর :৳১৮৭২  ",
  "৫৮.নাসিমা :অরুর হাজী৳৩০১২  ",
  " ৫৯.সোনা :মাঠ :৳৫৭৪",
  " ৬০.রিপন মোল্লা  : মাঠ:৳১১৫০ ",
  "৬১.নূর হোসেন   :ঢালি :৳১৪১৩  ",
  "৬২.মোস্তফা ঢালী :বদর ঢালী ৳১৬৩  ",
  " ৬৩.ফারুক সরদার :বাসার হাজী  ৳১৫১০ ",
  " ৬৪.আজিজ: ভ্যান ৳২১৫ ",
  "  ৬৫. জহুরুল :মজিদ তরকারি ৳ ৪৭৮",
  " ৬৬.আহসানউল্লাহ:জাফর মাস্টার ৳৩০ ",
  " ৬৭.মারুফ :শহিদুল স্যার ৳৯০ ",
  "৬৮. ছলু:কসাই৳ ৯৭০",

  "৬৯. সাইদ :রাজ্জাক মাস্টার ৳৪৯৭৮",
  " ৭০.মনিরুল সানা :তরমুজ৳৩০০",
  " ৭১.সিরাজুল সানা :আনা মামা ৳ ৩৯০",
  " ৭২.আরশাদ মামা৳৬০০",
  "৭৩.আশু,পানি৳১০০ ",
  " ৭৪.সোহেল বিডি ৳২২৪৮",
  " ৭৫. রফিকুল সেখ :আবেদার :৳৫৪০",
  "৭৬.সাইফুল হাডওয়ার৳১৪৯৬ ",
  " ৭৭.আবেদার( ভ্যান)বেয়াই ৳৪২২",
  " ৭৮.নূর ইসলাম শেখ  :রকিব শেখ :৳৫৩২",
  "৭৯.নূর মোহাম্মদ শেখ :রকিব শেখ ৳৯৬৮ ",
  "৮০.কামু: নেসার ঢালি ৳৪০০ ",
  " ৮১.মফিদা:শফিকুল বাড়ির পাশে ৳১০০",
  "৮২. সৌখিন আট৳৪৯৫ ",
  " ৮৩.মনিরুল  ( গরু)আবু তালের ৳৫৪০",
  "৮৪.আরিজুল  সানা৳ ২৩১  ",
  " ৮৫. আজুয়ারা:সানাপাড়া৳১৪০ ",
  " ৮৬.জেহের আলী৳১৮০ ",
  " ৮৭.সুমন ঢালী :মান্দার ঢালী :৩০৭০ ",
  "  ৮৮.মান্দার ঢালী ৳১৮১৯",
  " ৮৯.হিল্লাল :বিদেশ :৳২৯৬৬ ",
  " ৯০.শাহিন কারিগর :৳৩২০ ",
  " ৯১.সোহেল আলী :ঈমান :৳৩৫০ ",
  " ৯২. রিপন স্যার ৳১৭৫২ ",
  " ৯৩.তানজিলা :রহমানের বোন :৳২০০ ",
  " ৯৪.লিটন কারিগর :৳৩০ ",
  " ৯৫.ফারুক :ঔষধ ৳ ",
  " ৯৬. আলিম :ডেকোরেটর ৳২২৮৬ ",
  " ৯৭.কামরুল :কয়লা :৳৪১৯ ",
  " ৯৮.সাঈদ:শফিকুল বাড়ির পাশে  ৳১৭০ ",
  "৯৯.আলিম ঢালী :দিদার ডালি :৳৪৫৭  ",
  "  ১০০.সিরাজুল :শাহাদাত মোড়ল ৳৩৩০",
  " ১০১.আশরাফুল শেখ :আনিসুর :৳৭৪০ ",
  " ১০২.সালমা ভাবি :৳১১২৭ ",
  " ১০৩.রুবেল মোড়ল :ঈমান :৳৮৮৬ ",
  "  ১০৪. ভদি(আয়মান)শফিকুল বাড়ির পাশে ৳৩৬৫",
  " ১০৫.সওকাত মোড়ল :ঈমান মোড়ল৳১৭৫ ",
  " ১০৬.হামিদুল মোড়ল :ঈমান মোড়ল৳৩০০ ",
  " ১০৭.হযরত কারিগর :নাসিমার ভাই ৳২০০ ",
  " ১০৮.মিজানুর :তাবারক স্যার ৳৪০০ ",
  "১০৯. আবেদার :কাপড় ৳৪২২  ",
  " ১১০.নাসির :জুতা :৳৬০ ",
  " ১১১.রবিউল হুজুর :কাশেম স্যার বাড়ির পাশে ৳১৫৫ ",
  " ১১২.আরিফুল ফ্যান :আজগর ৳৩৭৭৫ ",
  "  ",
];

export default function Products() {
  const [query, setQuery] = useState("");

  const filteredData = data.filter((item) =>
    item.toLowerCase().includes(query.toLowerCase())
  );

  return (
    <div className="w-full  mx-auto  px-4 bg-red-200 text-black shadow-2xl  px-5 py-5 md:px-8 py-8 h-auto">
      <div className="max-w-xl mx-auto shadow-2xl p-10 mt-10 bg-white rounded-2xl">
        {/* Search Bar */}
        <h1 className="text-2xl text-green-600 font-bold text-center">
          Biswash Farmace
        </h1>
        <h1 className="text-bold text-2xl text-red-600 mt-2">
          All Costomer List
        </h1>
        <div className="flex items-center gap-3 bg-gray-100 rounded-full px-5 py-3 shadow-sm mt-5 ">
          <Search className="text-gray-500 p-5" size={18} />
          <input
            value={query}
            onChange={(e) => setQuery(e.target.value)}
            placeholder="Search by Costomer Name"
            className="bg-transparent w-full outline-none text-gray-700 placeholder-gray-500 text-bold"
          />
          {query && (
            <button
              onClick={() => setQuery("")}
              className="text-gray-500 hover:text-black"
            >
              <X size={18} />
            </button>
          )}
        </div>

        {/* Result */}
        {query && (
          <div className="mt-4 bg-white rounded-2xl shadow-2xl overflow-hidden">
            {filteredData.length > 0 ? (
              filteredData.map((item, i) => (
                <div
                  key={i}
                  className="px-6 py-3 text-sm hover:bg-gray-100 cursor-pointer font-bold text-[18px]"
                >
                  {item}
                </div>
              ))
            ) : (
              <p className="px-6 py-4 text-sm text-gray-500 mt-2 p-5">
                No results found
              </p>
            )}
          </div>
        )}
      </div>
    </div>
  );
}
